ПД_sev/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерFM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ПД_sev/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.НомерFM.Доступность = ОбщегоНазначенияПовтИсп.ПроверитьДоступностьРоли("ПолныеПрава");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоИНННаСервере()
	стрРеквизиты = IT_СервисДанныхЕдиныхГосРеестров.РеквизитыЮрЛицаПоИНН(Объект.ИНН);
	Если стрРеквизиты.ОписаниеОшибки = Неопределено Тогда
	 Объект.КПП = стрРеквизиты.КПП; 
	 Объект.ЮридическийАдрес = стрРеквизиты.ЮридическийАдрес.Представление;
	 Объект.Наименование = стрРеквизиты.Наименование;
	 Объект.ПолноеНаименование = стрРеквизиты.НаименованиеПолное;
	Иначе
		Сообщить(стрРеквизиты.ОписаниеОшибки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИНН(Команда)
	Если ПустаяСтрока(Объект.ИНН) Тогда
		Сообщить("Не заполнен ИНН");
		Возврат;
	КонецЕсли;
	ЗаполнитьПоИНННаСервере();
КонецПроцедуры
